app/controllers/albums_controller.rb

SELECT * FROM `albums` WHERE (`albums`.`id` = 1)
---
  def show
    @select_type = Album.find(:all, :order => :name)

SELECT * FROM "albums" LIMIT 8 OFFSET 0
SELECT count(*) AS count_all FROM "albums"
---
  def index
    @albums = Album.paginate(:per_page => 6, :page => params[:page])

INSERT INTO "albums" ("name", "created_at", "photo_file_size", "updated_at", "photo_file_name", "photo_content_type", "photo_updated_at", "artist_id") VALUES('Green Grass', '2010-02-06 01:05:42', NULL, '2010-02-06 01:05:42', NULL, NULL, NULL, NULL)
---
  def create
    @album = Album.create! params[:album]

SELECT * FROM "albums" WHERE ("albums"."id" = 10)
---
  def edit
    @album = Album.find(params[:id])

SELECT * FROM "albums" WHERE ("albums"."id" = 11)
UPDATE `albums` SET `updated_at` = '2010-01-29 09:13:33', `photo_file_name` = 'Screen_shot_2010-01-28_at_12.06.56_PM.png', `photo_updated_at` = '2010-01-29 09:13:32', `photo_file_size` = 19485, `photo_content_type` = 'image/png' WHERE `id` = 4
---
  def update
    @album = Album.find(params[:id])
    @album.update_attributes params[:album]

SELECT * FROM "albums" WHERE ("albums"."id" = 12)
DELETE FROM "albums" WHERE "id" = 12
---
  def destroy
    @album = Album.find(params[:id])
    @album.destroy