app/controllers/artists_controller.rb

  def show
    @artist = Artist.find(params[:id])


    sort = params[:sort] || 'name'
    sort_options={'name'=> 'name ASC', 'date' => 'created_at DESC'}
    @albums = @artist.albums.all :order => sort_options[sort]
---
SELECT * FROM "artists" WHERE ("artists"."id" = 0)
SELECT * FROM "albums" WHERE ("albums".artist_id = 4) ORDER BY albums.created_at DESC

  def index
    @artists = Artist.find(:all)
    @artists = Artist.paginate(:per_page => 5, :page => params[:page])
---
SELECT * FROM "artists" LIMIT 5 OFFSET 0
SELECT count(*) AS count_all FROM "artists"

  def create
    @artist = Artist.create! params[:artist]
---
INSERT INTO "artists" ("name", "created_at", "updated_at", "artist_info") VALUES('Harold Jones', '2010-03-04 05:02:18', '2010-03-04 05:02:18', NULL)

  def edit
    @artist = Artist.find(params[:id])
---
SELECT * FROM "artists" WHERE ("artists"."id" = 4)

  def update
    @artist = Artist.find(params[:id])
    @artist.update_attributes params[:artist]
---
SELECT * FROM "artists" WHERE ("artists"."id" = 4)
UPDATE "artists" SET "updated_at" = '2010-02-11 01:55:14', "name" = 'Dolly Parton a' WHERE "id" = 9

  def destroy
    @artist = Artist.find(params[:id])
    @artist.destroy
---
SELECT * FROM "artists" WHERE ("artists"."id" = 11)
DELETE FROM "artists" WHERE "id" = 11